{"card_name": "Advance", "color": "", "rarity": "special", "type": "Instant – Tactic", "number": 1, "color_identity": "", "cost": "{2}", "rules_text": "Create a 1/1 white Human creature token.\n[i](You start the game with a tactic deck of one copy each of Advance, Besiege, Provision, Retreat, and Scout. If Advance would be put into your graveyard, shuffle it into your tactic deck instead.)[/i]", "pt": "", "special_text": "", "shape": "normal", "set": "PRU", "loyalty": "", "notes": "Design Goals\n\nPerennial Ultimatum: A set designed for draft\n\nPerennial Ultimatum is structured like a modern standard-legal draft set, and the levels of power, speed, synergy, and complexity are comparable or slightly higher.\n\n\nThe range of card power is narrower; rares have higher ceilings than commons or uncommons, but require specific situations or deliberate deck building to reach that peak.\n\n\nMana fixing is plentiful, but two-colour decks, often with a splash, are the norm.\n\n\nThis set is based on a tabletop RPG campaign that I ran about the magical land of Faerie, the humans that found and conquered it, and how its residents pushed them back.\n\n\nA set designed excusively for limited players\n\n- follow the normal rules of a design skeleton\n- keep aggro in check by limiting early aggression, while keeping the early turns relevant\n- no massive power outliers, positive or negative\n- emphasize pools of synergy rather than rigid archetypes\n- no shuffling or planeswalkers\n- reduce wordiness whenever possible\n\nTokens:\n1/1 white Human\n1/1 red Cat\n2/2 green Fungus Elemental\n2/2 blue Illusion with flying\nX/X colorless Construct artifact creature\nCopy\nBasic Land\nTreasure\n\nThis card = Sprout (time spiral)\n\n4 person draft\n180 draftable cards\n20 tactic cards\n100 basic lands\n18 tokens\ntotal:\n280 sleeves of colour A\n38 sleeves of colour B\ndouble this for an 8-player draft\nFully decked cube for 8-person play = 3(4?) of each common, 2 of each uncommon, 1 of each rare/mythic = 303+160+53+15=521, plus 200 basics, 36 tokens, 40 tactics\nCollation process for 8 players: separate the commons by colour. From each colour, deal one card to each of the 24 packs, then 15 to the mess. From the lands and artifacts, deal one to each of the packs and 44 to the mess. Add one random card of any colour to the mess. Take the 120 cards of the mess and deal 5 of them to each pack.\n\nRevised since June", "image_type": "png"}